renesas/rx-driver-package/source/r_mmcif_rx/r_mmcif_rx_vx.xx/r_mmcif_rx/src/targets/rx64m/r_mmcif_dev.c
    if (MMC_CH0 == channel)
    {
#if defined(MMC_CFG_CH0_INCLUDED)
#ifdef MMC_CFG_USE_FIT
        R_BSP_InterruptWrite(BSP_INT_SRC_BL1_MMCIF_CDETIO, R_MMCIF_Int_Handler0);
        R_BSP_InterruptWrite(BSP_INT_SRC_BL1_MMCIF_ERRIO,  R_MMCIF_Int_Handler0);
        R_BSP_InterruptWrite(BSP_INT_SRC_BL1_MMCIF_ACCIO,  R_MMCIF_Int_Handler0);
#endif /* MMC_CFG_USE_FIT */

#endif  /* MMC_CFG_CH0_INCLUDED */
    }
    else    /* MMC_CH1 */
    {
#if defined(MMC_CFG_CH1_INCLUDED)
#ifdef MMC_CFG_USE_FIT
        R_BSP_InterruptWrite(BSP_INT_SRC_BL1_MMCIF_CDETIO, R_MMCIF_Int_Handler1);
        R_BSP_InterruptWrite(BSP_INT_SRC_BL1_MMCIF_ERRIO,  R_MMCIF_Int_Handler1);
        R_BSP_InterruptWrite(BSP_INT_SRC_BL1_MMCIF_ACCIO,  R_MMCIF_Int_Handler1);
#endif /* MMC_CFG_USE_FIT */

#endif  /* MMC_CFG_CH1_INCLUDED */
    }

    return MMC_SUCCESS;
}

/**********************************************************************************************************************
* Outline      : Finalize MMC Host IP
* Function Name: r_mmcif_dev_finalize
* Description  : Finalizes to access MMC.
* Arguments    : uint32_t           channel             ;   MMC Channel No.
* Return Value : MMC_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
mmc_status_t r_mmcif_dev_finalize(uint32_t channel)
{
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */

#ifdef MMC_CFG_USE_FIT
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);  /* Enable writing to MSTP registers. */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
    MSTP_MMCIF = 1;               /* MMC OFF */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
    if (1 == MSTP_MMCIF)
    {
        R_BSP_NOP();  /* Wait for the write completion. */
    }
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);   /* Disable writing to MSTP registers. */
#else
    SYSTEM.PRCR.WORD = 0xA502;
    if (0 == SYSTEM.PRCR.WORD)
    {
        R_BSP_NOP();  /* Wait for the write completion. */
    }
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
    MSTP_MMCIF = 1;               /* MMC OFF */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif  /* ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6) */
    if (1 == MSTP_MMCIF)
    {
        R_BSP_NOP();  /* Wait for the write completion. */
    }
    SYSTEM.PRCR.WORD = 0xA500;
    if (0 == SYSTEM.PRCR.WORD)
    {
        R_BSP_NOP();  /* Wait for the write completion. */
    }
    
#endif  /* MMC_CFG_USE_FIT */

    if (MMC_CH0 == channel)
    {
#if defined(MMC_CFG_CH0_INCLUDED)
#ifdef MMC_CFG_USE_FIT
        R_BSP_InterruptWrite(BSP_INT_SRC_BL1_MMCIF_CDETIO, FIT_NO_FUNC);
        R_BSP_InterruptWrite(BSP_INT_SRC_BL1_MMCIF_ERRIO,  FIT_NO_FUNC);
        R_BSP_InterruptWrite(BSP_INT_SRC_BL1_MMCIF_ACCIO,  FIT_NO_FUNC);
#endif /* MMC_CFG_USE_FIT */

#endif  /* MMC_CFG_CH0_INCLUDED */
    }
    else    /* MMC_CH1 */
    {
#if defined(MMC_CFG_CH1_INCLUDED)
#ifdef MMC_CFG_USE_FIT
        R_BSP_InterruptWrite(BSP_INT_SRC_BL1_MMCIF_CDETIO, FIT_NO_FUNC);
        R_BSP_InterruptWrite(BSP_INT_SRC_BL1_MMCIF_ERRIO,  FIT_NO_FUNC);
        R_BSP_InterruptWrite(BSP_INT_SRC_BL1_MMCIF_ACCIO,  FIT_NO_FUNC);
#endif /* MMC_CFG_USE_FIT */

#endif  /* MMC_CFG_CH1_INCLUDED */
    }

    return MMC_SUCCESS;
}

/**********************************************************************************************************************
* Outline      : Read from MMC
* Function Name: r_mmcif_dev_read_data
* Description  : Reads the sector data from the data register. 
* Arguments    : uint8_t            *p_buff             ;   Read data buffer
*              : uint32_t           reg_addr            ;   Register address
*              : int32_t            num                 ;   Number of data
* Return Value : MMC_SUCCESS                            ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
mmc_status_t r_mmcif_dev_read_data(uint8_t *p_buff, uint32_t reg_addr, int32_t num)
{
    int32_t  i = 0;
    uint32_t *p_reg = (uint32_t *)(reg_addr);
    uint32_t *p_ptr = (uint32_t *)p_buff;
    uint32_t tmp = 0;
    
    /* Revised, num++ -> num+=3 because the argument num may be set to 1, */
    /*          and num/4 value must be greater than 0.                   */ 
    num = num + 3;
    num = num / 4;

    if ((uint32_t)p_buff & 0x3)
    {
        /* WAIT_LOOP */
        for (i = num ; i > 0 ; i--)
        {
#if (MMC_BIG_ENDIAN)
            tmp = *p_reg;
            *p_buff++ = (uint8_t)(tmp >> 24);
            *p_buff++ = (uint8_t)(tmp >> 16);
            *p_buff++ = (uint8_t)(tmp >> 8);
            *p_buff++ = (uint8_t)tmp;
#else
            tmp = *p_reg;
            *p_buff++ = (uint8_t)tmp;
            *p_buff++ = (uint8_t)(tmp >> 8);
            *p_buff++ = (uint8_t)(tmp >> 16);
            *p_buff++ = (uint8_t)(tmp >> 24);
#endif
        }
    }
    else
    {
        /* WAIT_LOOP */
        for (i = num ; i > 0 ; i--)
        {
            *p_ptr++ = *p_reg;
        }
    }

