renesas/rx-driver-package/source/r_mmcif_rx/r_mmcif_rx_vx.xx/r_mmcif_rx/src/targets/rx64m/r_mmcif_dev.c
    if (MMC_TIMER_MAX_CH <= channel)
    {
        return MMC_ERR;
    }

    /* ---- Check argument ---- */
    if ((0 >= msec) || (msec > 0x0fffffff))
    {
        return MMC_ERR;
    }
    gs_mmc_timer_cnt_out[channel][MMC_TIMER_CH_FLG] = 1;
    gs_mmc_timer_cnt_out[channel][MMC_TIMER_CH_COUNT] = 0;
    gs_mmc_timer_cnt_out[channel][MMC_TIMER_CH_MAX_COUNT] = (uint32_t)(msec);

    return MMC_SUCCESS;

}


/**********************************************************************************************************************
* Outline      : MMC Check timeout
* Function Name: r_mmcif_dev_check_timer
* Description  : Checks timeout to set r_mmcif_dev_start_timer function.
*              : If timeout,return MMC_ERR.In the case of others, return MMC_SUCCESS.
* Arguments    : uint32_t           channel             ;   Timer Channel No.
* Return Value : MMC_SUCCESS                            ;   Successful operation
*              : MMC_ERR                                ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
static mmc_status_t r_mmcif_dev_check_timer(uint32_t channel)
{
    mmc_status_t ret = MMC_SUCCESS;
    uint32_t gs_mmc_timer_cnt_out1 = gs_mmc_timer_cnt_out[channel][MMC_TIMER_CH_COUNT];
    uint32_t gs_mmc_timer_cnt_out2 = gs_mmc_timer_cnt_out[channel][MMC_TIMER_CH_MAX_COUNT];

    /* ---- Check compare ---- */
    if (gs_mmc_timer_cnt_out1 >= gs_mmc_timer_cnt_out2)
    {
        ret = MMC_ERR;
    }
    else
    {
        ret = MMC_SUCCESS;
    }

    return ret;
}


/**********************************************************************************************************************
* Outline      : MMC End timer for timeout
* Function Name: r_mmcif_dev_end_timer
* Description  : Stops timer to set r_mmcif_dev_start_timer function.
* Arguments    : uint32_t           channel             ;   Timer Channel No.
* Return Value : None
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
static void r_mmcif_dev_end_timer(uint32_t channel)
{
    gs_mmc_timer_cnt_out[channel][MMC_TIMER_CH_FLG] = 0;

    return;
}

#ifdef MMC_CFG_USE_FIT
/**********************************************************************************************************************
* Outline      : Hardware Lock
* Function Name: r_mmcif_dev_hardware_lock
* Description  : Hardware Lock.
* Arguments    : uint32_t           channel     ; Channel No.
* Return Value : true                           ; Lock was acquired.
*              : false                          ; Lock was not acquired.
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
bool r_mmcif_dev_hardware_lock(uint32_t channel)
{
    return R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_MMC + channel));
} /* End of function r_mmcif_dev_hardware_lock() */


/**********************************************************************************************************************
* Outline      : Hardware UnLock
* Function Name: r_mmcif_dev_hardware_unlock
* Description  : Hardware Lock.
* Arguments    : uint32_t           channel     ; Channel No.
* Return Value : true                           ; Lock was released.
*              : false                          ; Lock was not released.
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
bool r_mmcif_dev_hardware_unlock(uint32_t channel)
{
    return R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_MMC + channel));
} /* End of function r_mmcif_dev_hardware_unlock() */
#endif /* MMC_CFG_USE_FIT */


#endif /* BSP_MCU_RX64M */

/* End of File */
